performance/puma/server.txt
Running 10s test @ http://localhost:3001/server
  10 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.75ms    6.79ms  76.07ms   71.12%
    Req/Sec    88.13     18.58   150.00     67.30%
  8847 requests in 10.08s, 25.19MB read
Requests/sec:    877.60
Transfer/sec:      2.50MB